UT-Guadaloop/EmbeddedSystems-Gen2/MSP432_SDK/examples/nortos/MSP_EXP432E401Y/lwip/ethernet_weather/enet_weather.c
//*****************************************************************************
//
// enet_weather.c - Sample Weather application using lwIP.
//
// Copyright (c) 2014 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "ti/devices/msp432e4/inc/msp.h"
#include "ti/devices/msp432e4/driverlib/driverlib.h"
#include "pinout.h"
#include "cmdline.h"
#include "flash_pb.h"
#include "uartstdio.h"
#include "ustdlib.h"
#include "lwiplib.h"
#include "locator.h"
#include "eth_client.h"
#include "enet_weather.h"
#include "commands.h"
#include "json.h"

//##### INTERNAL BEGIN #####
#include "debug.h"
//##### INTERNAL END #####
//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>Ethernet Weather Application (enet_weather)</h1>
//!
//! <!--##### README BEGIN #####-->
//! This example application demonstrates the operation of the MSP432E4
//! evaluation kit as a weather reporting application.
//!
//! The application supports updating weather information from Open Weather Map
//! weather provider(http://openweathermap.org/).  The application uses the
//! lwIP stack to obtain an address through DNS, resolve the address of the
//! Open Weather Map site and then build and handle all of the requests
//! necessary to access the weather information.  The application can also use
//! a web proxy, allows for a custom city to be added to the list of cities and
//! toggles temperature units from Celsius to Fahrenheit.  The application
//! scrolls through the city list at a fixed interval when there is a valid
//! IP address and displays this information over the UART.
//!
//! The application will print the city name, status, humidity, current temp
//! and the high/low. In addition the application will display what city it
//! is currently updating. Once the app has scrolled through the cities a
//! a defined amount of times, it will attempt to update the information.
//!
//! UART0, connected to the Virtual Serial Port and running at 115,200, 8-N-1,
//! is used to display messages from this application.
//!
//!/ For additional details about Open Weather Map refer to their web page at:
//! http://openweathermap.org/
//!
//! For additional details on lwIP, refer to the lwIP web page at:
//! http://savannah.nongnu.org/projects/lwip/
//! <!--##### README END #####-->
//
//*****************************************************************************
//##### TEST_INSTRUCTIONS BEGIN #####
//
// If no Network Connection
//
// App should display the first city and hault until it receives a valid IP.
//
// Once the app receives a valid IP it will begin scrolling through the list
// of defined cities and display the status, humidity, current temp and
// high/low. It will also display the current city it is updating.
// After it has scrolled 10 times it will update again.
//
// Proxy configuration hardcoded in g_sDefaultParams.
//
// UART0, connected to the Virtual Serial Port and running at 115,200, 8-N-1,
// is used to display messages from this application.
//
//##### TEST_INSTRUCTIONS END #####

//*****************************************************************************
//
// Connection states for weather application.
//
//*****************************************************************************
volatile enum
{
    STATE_NOT_CONNECTED,
        STATE_NEW_CONNECTION,
        STATE_CONNECTED_IDLE,
        STATE_WAIT_DATA,
        STATE_UPDATE_CITY,
        STATE_WAIT_NICE,
}
g_iState = STATE_NOT_CONNECTED;

//*****************************************************************************
//
// Input buffer for the command line interpreter.
//
//*****************************************************************************
char g_cInput[APP_INPUT_BUF_SIZE];

//*****************************************************************************
//
// The city being displayed.
//
//*****************************************************************************
uint32_t g_ui32CityActive;

//*****************************************************************************
//
// The city being updated.
//
//*****************************************************************************
uint32_t g_ui32CityUpdating;

//*****************************************************************************
//
// Global for IP address.
//
//*****************************************************************************
uint32_t g_ui32IPaddr;

//*****************************************************************************
//
// Global to track whether we are processing commands or not.
//
//*****************************************************************************
uint32_t g_ui32ProcessingCmds;

//*****************************************************************************
//
// The delay count to reduce traffic to the weather server.
//
//*****************************************************************************
volatile uint32_t g_ui32Delay;

//*****************************************************************************
//
// Global to track number of times the app has cycled through the list of
// cities.
//
//*****************************************************************************
volatile uint32_t g_ui32Cycles;

//*****************************************************************************
//
// The delay count to update the UART.
//
//*****************************************************************************
uint32_t g_ui32UARTDelay;

//*****************************************************************************
//
// System Clock rate in Hertz.
//
//*****************************************************************************
uint32_t g_ui32SysClock;

//*****************************************************************************
//
// Varriable to track when to display the scrolling list of cities.
//
//*****************************************************************************
uint32_t g_ui32ShowCities;

//*****************************************************************************
//
// Varriable to track when to update the UART.
//
//*****************************************************************************
uint32_t g_UpdateUART = 1;

//*****************************************************************************
//
// Storage for the filename list box widget string table.
//
//*****************************************************************************
#define NUM_CITIES              30

//*****************************************************************************
//
// The defaults for the flash and application settings.
//
//*****************************************************************************
static const sParameters g_sDefaultParams =
{
    0,
    {"Custom City Name"},
    //##### INTERNAL BEGIN #####
    {"wwwgate.ti.com"},
#if 0
    //##### INTERNAL END #####
    {"your.proxy.com"},
    //##### INTERNAL BEGIN #####
#endif
    //##### INTERNAL END #####
    false,
    false,
    //##### INTERNAL BEGIN #####
    true,
#if 0
    //##### INTERNAL END #####
    false,
    //##### INTERNAL BEGIN #####
#endif
    //##### INTERNAL END #####
    false
};

//
// The current live configuration settings for the application.
//
sParameters g_sConfig;

//*****************************************************************************
//
// The state of each city panel.
//
//*****************************************************************************
struct
{
    //
    // The last update time for this city.
    //
    uint32_t ui32LastUpdate;

    //
    // The current weather report data for this city.
    //
    tWeatherReport sReport;

    //
    // Indicates if the city needs updating.
    //
    bool bNeedsUpdate;

    //
    // The name of the current city.
    //
    const char *pcName;
}
g_psCityInfo[NUM_CITIES];

//
// The list of city names.
//
static const char *g_ppcCityNames[NUM_CITIES - 1] =
{
    "Austin, TX",
    "Beijing, China",
    "Berlin, Germany",
    "Boston, MA",
    "Buenos Aires, Argentina",
    "Chicago, IL",
    "Dallas, TX",
    "Frankfurt, Germany",
    "Hong Kong, HK",
    "Jerusalem, Israel",
    "Johannesburg, ZA",
    "London, England",
    "Mexico City, Mexico",
    "Moscow, Russia",
    "New Delhi, India",
    "New York, NY",
    "Paris, France",
    "Rome, Italy",
    "San Jose, CA",
    "Sao Paulo, Brazil",
    "Seoul, S. Korea",
    "Shanghai, China",
    "Shenzhen, China",
    "Singapore City, Singapore",
    "Sydney, Australia",
    "Taipei, Taiwan",
    "Tokyo, Japan",
    "Toronto, Canada",
    "Vancouver, Canada"
};

//*****************************************************************************
//
// Constant strings for status messages.
//
//*****************************************************************************
const char g_pcNotFound[] = "City Not Found";
const char g_pcServerBusy[] = "Server Busy";
const char g_pcWaitData[] = "Waiting for Data";

//*****************************************************************************
//
// Interrupt priority definitions.  The top 3 bits of these values are
// significant with lower values indicating higher priority interrupts.
//
//*****************************************************************************
#define SYSTICK_INT_PRIORITY    0x80
#define ETHERNET_INT_PRIORITY   0xC0

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

//*****************************************************************************
//
// Variables for the various temperature parametrics.
//
//*****************************************************************************
char g_pcTempHighLow[40] = "--/--C";
char g_pcTemp[40] = "--C";
char g_pcHumidity[40] = "Humidity: --%";
char g_pcStatus[40];
char g_pcCity[40];

//*****************************************************************************
//
// MAC address.
//
//*****************************************************************************
char g_pcMACAddr[40];

//*****************************************************************************
//
// IP address.
//
//*****************************************************************************
char g_pcIPAddr[20];

//*****************************************************************************
//
// Celsius to Fahrenheit conversion.
//
//*****************************************************************************
static int32_t
TempCtoF(int32_t i32Temp)
{
    //
    // Only convert if measurements are not in Celsius.
    //
    if(g_sConfig.bCelsius == false)
    {
        i32Temp = ((i32Temp * 9) / 5) + 32;
    }

