UT-Guadaloop/EmbeddedSystems-Gen2/MSP432_SDK/examples/nortos/MSP_EXP432E401Y/lwip/ethernet_weather/enet_weather.c
    return(i32Temp);
}

//*****************************************************************************
//
// Reset a cities information so that it can be properly updated.
//
//*****************************************************************************
void
ResetCity(uint32_t ui32Idx)
{
    g_psCityInfo[ui32Idx].sReport.i32Pressure = INVALID_INT;
    g_psCityInfo[ui32Idx].sReport.i32Humidity = INVALID_INT;
    g_psCityInfo[ui32Idx].sReport.i32Temp = INVALID_INT;
    g_psCityInfo[ui32Idx].sReport.i32TempHigh = INVALID_INT;
    g_psCityInfo[ui32Idx].sReport.i32TempLow = INVALID_INT;
    g_psCityInfo[ui32Idx].sReport.pcDescription = 0;
    g_psCityInfo[ui32Idx].sReport.pui8Image = 0;
    g_psCityInfo[ui32Idx].sReport.ui32SunRise = 0;
    g_psCityInfo[ui32Idx].sReport.ui32SunSet = 0;
    g_psCityInfo[ui32Idx].sReport.ui32Time = 0;
    g_psCityInfo[ui32Idx].ui32LastUpdate = 0;

    //
    // Make sure to copy the name into the string for a custom city.
    //
    if(ui32Idx == NUM_CITIES - 1)
    {
        //
        // Custom city is in another list.
        //
        g_psCityInfo[ui32Idx].pcName = g_sConfig.pcCustomCity;

        if(g_ui32CityActive == ui32Idx)
        {
            //
            // Update the custom city name.
            //
            ustrncpy(g_pcCity, g_psCityInfo[ui32Idx].pcName, sizeof(g_pcCity));
        }

        //
        // The custom city only needs an update if enabled.
        //
        if(g_sConfig.bCustomEnabled)
        {
            g_psCityInfo[ui32Idx].bNeedsUpdate = true;
        }
    }
    else
    {
        g_psCityInfo[ui32Idx].pcName = g_ppcCityNames[ui32Idx];
        g_psCityInfo[ui32Idx].bNeedsUpdate = true;
    }
}

//*****************************************************************************
//
// Update the IP address string.
//
//*****************************************************************************
void
UpdateIPAddress(char *pcAddr, uint32_t ipAddr)
{
    uint8_t *pui8Temp = (uint8_t *)&ipAddr;

    if(ipAddr == 0)
    {
        ustrncpy(pcAddr, "IP: ---.---.---.---", sizeof(g_pcIPAddr));
    }
    else
    {
        usprintf(pcAddr,"IP: %d.%d.%d.%d", pui8Temp[0], pui8Temp[1],
                pui8Temp[2], pui8Temp[3]);
    }
}

//*****************************************************************************
//
// Handles the proxy select button presses.
//
//*****************************************************************************
void
ProxyEnable(void)
{
    //
    // If a city was waiting to be updated then reset its data.
    //
    if(g_iState != STATE_CONNECTED_IDLE)
    {
        ResetCity(g_ui32CityUpdating);
    }

    //
    // Reset the state to not connected.
    //
    g_iState = STATE_NOT_CONNECTED;

    //
    // Toggle the proxy setting.
    //
    if(!g_sConfig.bProxyEnabled)
    {
        //
        // Reset the IP address on the screen and disable the proxy which
        // resets the network interface and starts DHCP again.
        //
        UpdateIPAddress(g_pcIPAddr, 0);
        EthClientProxySet(0);

    }
    else
    {
        //
        // Enable the proxy which resets the network interface and starts DHCP
        // again.
        //
        EthClientProxySet(g_sConfig.pcProxy);
    }

    //
    // A change was made so update the settings in flash.
    //
    g_sConfig.bSave = true;
}

//*****************************************************************************
//
// Update the information for the current city.
//
//*****************************************************************************
void
UpdateCity(uint32_t ui32Idx, bool bDraw)
{
    char cUnits;
    bool bIntDisabled;

    //
    // Need to disable interrupts since this can be called from interrupt
    // handlers for both System tick and Ethernet controller and from the
    // main routine.
    //
    bIntDisabled = IntMasterDisable();

    if(g_sConfig.bCelsius)
    {
        cUnits = 'C';
    }
    else
    {
        cUnits = 'F';
    }

    //
    // Update the city.
    //
    ustrncpy(g_pcCity, g_psCityInfo[ui32Idx].pcName, sizeof(g_pcCity));

    //
    // Check if the humidity value is valid.
    //
    if(g_psCityInfo[ui32Idx].sReport.i32Humidity == INVALID_INT)
    {
        usprintf(g_pcHumidity, "Humidity: --");
    }
    else
    {
        usprintf(g_pcHumidity, "Humidity: %d",
                g_psCityInfo[ui32Idx].sReport.i32Humidity);
    }

    //
    // Copy the updated description.
    //
    if(g_psCityInfo[ui32Idx].sReport.pcDescription)
    {
        ustrncpy(g_pcStatus, g_psCityInfo[ui32Idx].sReport.pcDescription,
                sizeof(g_pcStatus));
    }
    else if((g_ui32CityUpdating == g_ui32CityActive) &&
            (g_iState != STATE_NOT_CONNECTED))
    {
        //
        // Waiting on data for this city.
        //
        ustrncpy(g_pcStatus, g_pcWaitData, sizeof(g_pcStatus));
    }
    else
    {
        //
        // No current status.
        //
        ustrncpy(g_pcStatus, "--", sizeof(g_pcStatus));
    }


    //
    // Check if the temperature value is valid.
    //
    if(g_psCityInfo[ui32Idx].sReport.i32Temp == INVALID_INT)
    {
        usprintf(g_pcTemp, "--%c", cUnits);
        usprintf(g_pcTempHighLow, "--/--%c",
                TempCtoF(g_psCityInfo[ui32Idx].sReport.i32TempHigh),
                TempCtoF(g_psCityInfo[ui32Idx].sReport.i32TempLow), cUnits);
    }
    else
    {
        usprintf(g_pcTemp, "%d%c",
                TempCtoF(g_psCityInfo[ui32Idx].sReport.i32Temp), cUnits);
        usprintf(g_pcTempHighLow, "%d/%d%c",
                TempCtoF(g_psCityInfo[ui32Idx].sReport.i32TempHigh),
                TempCtoF(g_psCityInfo[ui32Idx].sReport.i32TempLow), cUnits);
    }

    //
    // Update the information if requested.
    //
    if(bDraw)
    {
        UARTprintf((const char *)&g_pcCity);
        UARTprintf("\n\tStatus: ");
        UARTprintf((const char *)&g_pcStatus);
        UARTprintf("\n\t");
        UARTprintf((const char *)&g_pcHumidity);
        UARTprintf("%%\n\tTemperature: ");
        UARTprintf((const char *)&g_pcTemp);
        UARTprintf("\n\tHigh/Low: ");
        UARTprintf((const char *)&g_pcTempHighLow);
    }

