UT-Guadaloop/EmbeddedSystems-Gen2/MSP432_SDK/examples/nortos/MSP_EXP432E401Y/lwip/ethernet_weather/enet_weather.c
    if(bIntDisabled == false)
    {
        IntMasterEnable();
    }
}

//*****************************************************************************
//
// Update the MAC address string.
//
//*****************************************************************************
void
UpdateMACAddr(void)
{
    uint8_t pui8MACAddr[6];

    EthClientMACAddrGet(pui8MACAddr);

    usprintf(g_pcMACAddr, "MAC: %02x:%02x:%02x:%02x:%02x:%02x",
            pui8MACAddr[0], pui8MACAddr[1], pui8MACAddr[2], pui8MACAddr[3],
            pui8MACAddr[4], pui8MACAddr[5]);
}

//*****************************************************************************
//
// Print the IP address string.
//
//*****************************************************************************
void
PrintIPAddress(char *pcAddr, uint32_t ipaddr)
{
    uint8_t *pui8Temp = (uint8_t *)&ipaddr;

    //
    // Convert the IP Address into a string.
    //
    UARTprintf("%d.%d.%d.%d\n", pui8Temp[0], pui8Temp[1], pui8Temp[2],
            pui8Temp[3]);
}

//*****************************************************************************
//
// Prompts the user for a command, and blocks while waiting for the user's
// input. This function will return after the execution of a single command.
//
//*****************************************************************************
void
CheckForUserCommands(void)
{
    int iStatus;

    //
    // Peek to see if a full command is ready for processing
    //
    if(UARTPeek('\r') == -1)
    {
        //
        // If not, return so other functions get a chance to run.
        //
        return;
    }

    //
    // If we do have commands, process them immediately in the order they were
    // received.
    //
    while(UARTPeek('\r') != -1)
    {
        //
        // Indicate we are processing a command.
        //
        g_ui32ProcessingCmds = 1;

        //
        // Get a user command back
        //
        UARTgets(g_cInput, APP_INPUT_BUF_SIZE);

        //
        // Process the received command
        //
        iStatus = CmdLineProcess(g_cInput);

        //
        // Handle the case of bad command.
        //
        if(iStatus == CMDLINE_BAD_CMD)
        {
            UARTprintf("Bad command!\n");
        }

        //
        // Handle the case of too many arguments.
        //
        else if(iStatus == CMDLINE_TOO_MANY_ARGS)
        {
            UARTprintf("Too many arguments for command processor!\n");
        }
    }

    //
    // Print a prompt
    //
    UARTprintf("\n> ");

}

//*****************************************************************************
//
// Updates the UART information.
//
//*****************************************************************************
void
UpdateUART(uint32_t ui32City)
{
    volatile uint32_t ui32IPaddr;
    uint32_t    ui32Idx;

    //
    // See if the user has hit 'ENTER'
    //
    if(UARTPeek('\r') != -1 && g_ui32ShowCities)
    {
        //
        // Get a user command back
        //
        UARTgets(g_cInput, APP_INPUT_BUF_SIZE);

        //
        // Update the state and redraw the UART.
        //
        g_UpdateUART = 1;
        g_ui32ShowCities = 0;
        g_ui32ProcessingCmds = 0;
        g_ui32CityActive = 0;
        g_ui32Cycles = 0;
        g_ui32UARTDelay = 0;
    }

    //
    // Get the IP address.
    //
    ui32IPaddr = EthClientAddrGet();

    //
    // If the IP changed, reassign.
    //
    if (g_ui32IPaddr != ui32IPaddr)
    {
        //
        // Reassign the global IP to the current.
        //
        g_ui32IPaddr = ui32IPaddr;

        //
        // Update the UART.
        //
        g_UpdateUART = 1;
    }

    //
    // Check if we should scroll the cities.
    //
    if (g_ui32UARTDelay == 0 && g_ui32ShowCities)
    {
        //
        // Clear the terminal.  Print the banner and IP place holder.
        //
        UARTprintf("\033[2J\033[H");
        UARTprintf("Ethernet Weather Example\n\n");
        UARTprintf("IP: ");

        //
        // Print the IP address.
        //
        PrintIPAddress(g_pcIPAddr, ui32IPaddr);
        UARTprintf("\n");
        UARTprintf("Hit 'ENTER' to exit\n\n");

        //
        // Print the current city information.
        //
        UpdateCity(ui32City, true);

        //
        // 'Updating' banner.
        //
        UARTprintf("\n__________________________\n\nUpdating:");

        if (g_ui32Cycles >= UPDATE_CYCLES)
        {
            //
            // Reset the cities so that they update.
            //
            for(ui32Idx = 0; ui32Idx < NUM_CITIES; ui32Idx++)
            {
                ResetCity(ui32Idx);
            }

            //
            // Indicate that we have reset all of the cities.
            //
            g_ui32Cycles = 0;
        }

        //
        // Reset the delay.
        //
        g_ui32UARTDelay = CYCLE_DELAY;

        if (ui32IPaddr != 0 && ui32IPaddr != 0xffffffff)
        {
            //
            // Increment the display city.
            //
            g_ui32CityActive++;

            //
            // Check if the current city index is at the end.
            //
            if ((g_ui32CityActive >= NUM_CITIES - 1 &&
                        g_sDefaultParams.bCustomEnabled == false) ||
                    (g_ui32CityActive >= NUM_CITIES &&
                     g_sDefaultParams.bCustomEnabled == true))
            {
                g_ui32CityActive = 0;
                g_ui32Cycles++;
            }
        }

        g_UpdateUART = 0;
    }
    else if (g_ui32UARTDelay == 0 && (ui32IPaddr == 0 ||
                ui32IPaddr == 0xffffffff))
    {
        //
        // Reset the delay.
        //
        g_ui32UARTDelay = CYCLE_DELAY;
    }

    else if (g_ui32UARTDelay > 0)
    {
        g_ui32UARTDelay--;
    }

    //
    // Check if we need to update the UART with the standard text.
    //
    if (g_UpdateUART && !g_ui32ShowCities && !g_ui32ProcessingCmds)
    {
        //
        // Clear the terminal.  Print the banner and IP place holder.
        //
        UARTprintf("\033[2J\033[H");
        UARTprintf("Ethernet Weather Example\n\n");
        UARTprintf("IP: ");

        //
        // Print the IP address.
        //
        PrintIPAddress(g_pcIPAddr, ui32IPaddr);
        UARTprintf("\n");
        UARTprintf("Type 'help' for help.\n\n>");

        //
        // Dont need to update anymore.
        //
        g_UpdateUART = 0;
    }

    //
    // If we are not scrolling. Check for commands.
    //
    if (!g_ui32ShowCities)
    {
        //
        // Check for user commands.
        //
        CheckForUserCommands();
    }
}

//*****************************************************************************
//
// The weather event handler.
//
//*****************************************************************************
void
WeatherEvent(uint32_t ui32Event, void* pvData, uint32_t ui32Param)
{
    //##### INTERNAL BEGIN #####
#ifdef DEBUG
    UARTprintf("\nWeatherEvent() %08x, %08x, %08x", ui32Event, pvData,
            ui32Param);
#endif
    //##### INTERNAL END #####

    if(ui32Event == ETH_EVENT_RECEIVE)
    {
        //
        // Let the main loop update the city.
        //
        g_iState = STATE_UPDATE_CITY;

