UT-Guadaloop/EmbeddedSystems-Gen2/MSP432_SDK/examples/nortos/MSP_EXP432E401Y/lwip/ethernet_weather/enet_weather.c
        g_psCityInfo[g_ui32CityUpdating].ui32LastUpdate =
            g_psCityInfo[g_ui32CityUpdating].sReport.ui32Time;
    }
    else if(ui32Event == ETH_EVENT_INVALID_REQ)
    {
        g_psCityInfo[g_ui32CityUpdating].sReport.pcDescription = g_pcNotFound;
        g_iState = STATE_UPDATE_CITY;
    }
    else if(ui32Event == ETH_EVENT_CLOSE)
    {
        if(g_iState == STATE_WAIT_DATA)
        {
            g_psCityInfo[g_ui32CityUpdating].sReport.pcDescription =
                g_pcServerBusy;

            g_iState = STATE_UPDATE_CITY;
        }
    }

    //
    // If the update indicated no time, then just set the time to a value
    // to indicate that at least the update occurred.
    //
    if(g_psCityInfo[g_ui32CityUpdating].ui32LastUpdate == 0)
    {
        //
        // Failed to update for some reason.
        //
        g_psCityInfo[g_ui32CityUpdating].ui32LastUpdate = 1;
    }
}

//*****************************************************************************
//
// The interrupt handler for the SysTick interrupt.
//
//*****************************************************************************
void
SysTick_Handler(void)
{
    //
    // Call the lwIP timer handler.
    //
    EthClientTick(SYSTEM_TICK_MS);

    //
    // Handle the delay between accesses to the weather server.
    //
    if(g_ui32Delay != 0)
    {
        g_ui32Delay--;
    }
}

//*****************************************************************************
//
// Network events handler.
//
//*****************************************************************************
void
EnetEvents(uint32_t ui32Event, void *pvData, uint32_t ui32Param)
{
    if(ui32Event == ETH_EVENT_CONNECT)
    {
        g_iState = STATE_NEW_CONNECTION;

        //
        // Update the string version of the address.
        //
        UpdateIPAddress(g_pcIPAddr, EthClientAddrGet());
        //##### INTERNAL BEGIN #####
#ifdef DEBUG_OUTPUT
        PrintIPAddress(g_pcIPAddr, EthClientServerAddrGet());
#endif
        //##### INTERNAL END #####
    }
    else if(ui32Event == ETH_EVENT_DISCONNECT)
    {
        //
        // If a city was waiting to be updated then reset its data.
        //
        if(g_iState != STATE_CONNECTED_IDLE)
        {
            ResetCity(g_ui32CityUpdating);
        }

        g_iState = STATE_NOT_CONNECTED;

        //
        // Update the address to 0.0.0.0.
        //
        UpdateIPAddress(g_pcIPAddr, 0);
    }
}

//*****************************************************************************
//
// This example demonstrates the use of the Ethernet Controller.
//
//*****************************************************************************
int
main(void)
{
    enum
    {
        eRequestIdle,
        eRequestUpdate,
        eRequestForecast,
        eRequestCurrent,
        eRequestComplete,
    }
    iRequest;
    int32_t i32City;
    sParameters *pParams;
    iRequest = eRequestIdle;

    //
    // Make sure the main oscillator is enabled because this is required by
    // the PHY.  The system must have a 25MHz crystal attached to the OSC
    // pins.  The SYSCTL_MOSC_HIGHFREQ parameter is used when the crystal
    // frequency is 10MHz or higher.
    //
    SysCtlMOSCConfigSet(SYSCTL_MOSC_HIGHFREQ);

    //
    // Run from the PLL at 120 MHz.
    //
    g_ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                SYSCTL_OSC_MAIN |
                SYSCTL_USE_PLL |
                SYSCTL_CFG_VCO_480), 120000000);

    //
    // Configure the device pins.
    //
    PinoutSet(true, false);

    //
    // Initialize the UART.
    //
    UARTStdioConfig(0, 115200, g_ui32SysClock);

    //
    // Configure SysTick for a periodic interrupt at 10ms.
    //
    SysTickPeriodSet((g_ui32SysClock / 1000) * SYSTEM_TICK_MS);
    SysTickEnable();
    SysTickIntEnable();

    //
    // Initialized the flash program block and read the current settings.
    //
    FlashPBInit(FLASH_PB_START, FLASH_PB_END, 256);
    pParams = (sParameters *)FlashPBGet();

    //
    // Use the defaults if no settings were found.
    //
    if(pParams == 0)
    {
        g_sConfig = g_sDefaultParams;
    }
    else
    {
        g_sConfig = *pParams;
    }

    //
    // Initialize all of the cities.
    //
    for(i32City = 0; i32City < NUM_CITIES; i32City++)
    {
        ResetCity(i32City);
    }

    //
    // Set the IP address to 0.0.0.0.
    //
    UpdateIPAddress(g_pcIPAddr, 0);

    //
    // Enable processor interrupts.
    //
    IntMasterEnable();

    //
    // Set the interrupt priorities.  We set the SysTick interrupt to a higher
    // priority than the Ethernet interrupt to ensure that the file system
    // tick is processed if SysTick occurs while the Ethernet handler is being
    // processed.  This is very likely since all the TCP/IP and HTTP work is
    // done in the context of the Ethernet interrupt.
    //
    IntPriorityGroupingSet(4);
    IntPrioritySet(INT_EMAC0, ETHERNET_INT_PRIORITY);
    IntPrioritySet(FAULT_SYSTICK, SYSTICK_INT_PRIORITY);

    if(g_sConfig.bProxyEnabled)
    {
        EthClientProxySet(g_sConfig.pcProxy);
        EthClientInit(EnetEvents);
    }
    else
    {
        EthClientProxySet(0);
        EthClientInit(EnetEvents);
    }

    UpdateMACAddr();

    //
    // Initialize the city index and enable swipe detection.
    //
    g_ui32CityActive = 0;
    g_ui32CityUpdating = 0;

    //
    // Get the IP address.
    //
    g_ui32IPaddr = EthClientAddrGet();

    //
    // Update the current city information.
    //
    UpdateUART(g_ui32CityActive);

    //
    // Loop forever.  All the work is done in interrupt handlers.
    //
    while(1)
    {
        if(g_iState == STATE_NEW_CONNECTION)
        {
            iRequest = eRequestIdle;

            g_iState = STATE_CONNECTED_IDLE;
        }
        else if(g_iState == STATE_CONNECTED_IDLE)
        {
            if(iRequest == eRequestIdle)
            {
                //
                // If this city needs updating then start an update.
                //
                if((g_psCityInfo[g_ui32CityUpdating].bNeedsUpdate) &&
                        ((g_ui32CityUpdating < NUM_CITIES - 1) ||
                         (g_sConfig.bCustomEnabled == true)))
                {
                    iRequest = eRequestUpdate;
                }

                if(iRequest != eRequestUpdate)
                {
                    //
                    // If the custom city is enabled and it needs updating,
                    // then update it first.
                    //
                    if((g_psCityInfo[NUM_CITIES - 1].bNeedsUpdate) &&
                            (g_sConfig.bCustomEnabled == true))
                    {
                        g_ui32CityUpdating = NUM_CITIES - 1;
                    }
                    else
                    {
                        //
                        // Move on to the next city to see if it needs to be
                        // updated on the next pass.
                        //
                        g_ui32CityUpdating++;
                    }

                    if(g_ui32CityUpdating >= NUM_CITIES)
                    {
                        g_ui32CityUpdating = 0;
                    }
                }
            }
            else if(iRequest == eRequestUpdate)
            {
                //
                // Print the current city being updated.
                //
                if (g_ui32ShowCities)
                {
                    UARTprintf("\n\t%s",
                               g_psCityInfo[g_ui32CityUpdating].pcName);
                }

