UT-Guadaloop/EmbeddedSystems-Gen2/MSP432_SDK/examples/nortos/MSP_EXP432E401Y/lwip/ethernet_weather/enet_weather.c
                g_iState = STATE_WAIT_DATA;

                //
                // Timeout at 10 seconds.
                //
                g_ui32Delay = 1000;

                WeatherForecast(iWSrcOpenWeatherMap,
                        g_psCityInfo[g_ui32CityUpdating].pcName,
                        &g_psCityInfo[g_ui32CityUpdating].sReport,
                        WeatherEvent);

                iRequest = eRequestForecast;
            }
            else if(iRequest == eRequestForecast)
            {
                g_iState = STATE_WAIT_DATA;

                //
                // Timeout at 10 seconds.
                //
                g_ui32Delay = 1000;

                WeatherCurrent(iWSrcOpenWeatherMap,
                        g_psCityInfo[g_ui32CityUpdating].pcName,
                        &g_psCityInfo[g_ui32CityUpdating].sReport,
                        WeatherEvent);

                iRequest = eRequestCurrent;
            }
            else if(iRequest == eRequestCurrent)
            {
                //
                // Return to the idle request state.
                //
                iRequest = eRequestIdle;

                //
                // Done updating this city.
                //
                g_psCityInfo[g_ui32CityUpdating].bNeedsUpdate = false;
            }
        }
        else if(g_iState == STATE_UPDATE_CITY)
        {
            if(iRequest == eRequestCurrent)
            {
                //
                // If the city is the current active city and the the
                // application is on the main screen then update the screen
                // and not just the values.
                //
                if(g_ui32CityUpdating == g_ui32CityActive)
                {
                    //
                    // Update the current city.
                    //
                    UpdateCity(g_ui32CityUpdating, false);
                }

                //
                // Done updating this city.
                //
                g_psCityInfo[g_ui32CityUpdating].bNeedsUpdate = false;
            }

            //
            // Go to the wait nice state.
            //
            g_iState = STATE_WAIT_NICE;

            //
            // 10ms * 10 is a 1 second delay between updates.
            //
            g_ui32Delay = SYSTEM_TICK_MS * 10;
        }
        else if(g_iState == STATE_WAIT_NICE)
        {
            //
            // Wait for the "nice" delay to not hit the server too often.
            //
            if(g_ui32Delay == 0)
            {
                g_iState = STATE_CONNECTED_IDLE;
            }
        }
        else if(g_iState == STATE_WAIT_DATA)
        {
            //
            // If no data has been received by the timeout then close the
            // connection.
            //
            if(g_ui32Delay == 0)
            {
                //
                // Close out the current connection.
                //
                EthClientTCPDisconnect();
            }
        }

        //
        // Update the UART.
        //
        UpdateUART(g_ui32CityActive);
    }
}

